[aruba]

# EXTRACT
EXTRACT-fields = \s(?<module>[^\[\s]+)\[(?:[^\<])*\<(?<error_number>[^\>]+)\>\s+\<(?<log_level>[^\>]*)\>\s+\<(?<dvc_name>[^\s]*)\s+(?<dvc_ip>[^\>]*)\>\s+(?<message>(?:\|(?<process>[^\|]*)\|\s+(?<query>.*))?(?:.*user_ip_address\((?<src_ip>[^\)]*)\))?(?:.*uuid\((?<uuid>[^\)]*)\))?(?:(?:.*mac\((?<dvc_mac>[^\)]*)\))?(?:.*name\((?<user>[^\)]*)?)?(?:.*role\((?<role>[^\)]*)\))?(?:.*devtype\((?<dev_type>[^\)]*)\))?(?:.*wired\((?<wired>[^\)]*)\))?(?:.*auth_type\((?<auth_type>[^\)]*)\))?(?:.*auth_subtype\((?<auth_subtype>[^\)]*)\))?(?:.*encrypt_type\((?<encrypt_type>[^\)]*)\))?(?:.*conn_port\((?<conn_port>[^\)]*)\))?.*))
EXTRACT-mac = (?<mac>(?:[0-9A-Fa-f]{2}[:-]){5}(?:[0-9A-Fa-f]{2}))
EXTRACT-bssid = (?:BSSID|bssid)\s(?<bssid>(?:[0-9A-Fa-f]{2}[:-]){5}(?:[0-9A-Fa-f]{2}))
EXTRACT-detector = Detector-AP-Name:(?<ap_name>[^\;]*); Detector-AP-MAC:(?<ap_mac>[^\;]*); Detector-AP-Radio:(?<ap_radio>[^\.]*)\.
EXTRACT-ssid = \s(?:SSID|ssid)\s(?<ssid>.*)\son

# REPORT


# LOOKUP
LOOKUP-error_lookup = aruba_error_lookup error_number OUTPUTNEW error_desc

# KV_MODE


# FIELDALIAS (CIM compliant)
FIELDALIAS-srcip = srcip AS src_ip
FIELDALIAS-destip = dstip AS dest_ip
FIELDALIAS-srcport = srcport AS src_port
FIELDALIAS-destport = dstport AS dest_port
FIELDALIAS-mac = MAC AS mac

# TRANSFORMS
TRANSFORMS-sourcetype = aruba_threat


[aruba:threat]

SHOULD_LINEMERGE = false

EXTRACT-rogue_ap_info = (?:\s\(BSSID\s(?<bssid>(?:[0-9A-Fa-f]{2}[:-]){5}(?:[0-9A-Fa-f]{2}))\sand\sSSID\s(?<ssid>.*)\son\sCHANNEL\s(?<channel>[^\)]*)\))
EXTRACT-ap_info = \|ids\|\s+(?:AP\((?<dvc_mac>(?:[0-9A-Fa-f]{2}[:-]){5}(?:[0-9A-Fa-f]{2}))@(?<dvc_name>[^\)]*)\))?
EXTRACT-ap_details = Detector-AP-Name:(?<dvc_name>[^\;]*); Detector-AP-MAC:(?<dvc_mac>(?:[0-9A-Fa-f]{2}[:-]){5}(?:[0-9A-Fa-f]{2})); Detector-AP-Radio:(?<dvc_radio>[^\.]*)


[aruba:auth]

EXTRACT-user = name\((?<user>[^\)]*)\)




[aruba:default]

#Authentication	action	string	The action performed on the resource.	success, failure, unknown
#Authentication	app	string	The application involved in the event (such as ssh, splunk, win:local).
#Authentication	dest	string	The target involved in the authentication. You can alias this from more specific fields, such as dest_host, dest_ip, or dest_nt_host.
#Authentication	dest_bunit	string	The business unit of the authentication target.

#This field is automatically provided by Asset and Identity correlation features of applications like Splunk Enterprise Security.
#Authentication	dest_category	string	The category of the authentication target, such as email_server or SOX-compliant.

#This field is automatically provided by Asset and Identity correlation features of applications like Splunk Enterprise Security.
#Authentication	dest_nt_domain	string	The name of the Active Directory used by the authentication target, if applicable.
#Authentication	dest_priority	string	The priority of the authentication target.
#Authentication	duration	number	The amount of time for the completion of the authentication event, in seconds.
#Authentication	response_time	number	The amount of time it took to receive a response in the authentication event, in seconds.
#Authentication	src	string	The source involved in the authentication. In the case of endpoint protection authentication the src is the client. You can alias this from more specific fields, such as src_host, src_ip, or src_nt_host.

#Note: Do not confuse src with the event source or sourcetype fields.
#Authentication	src_bunit	string	The business unit of the authentication source.#


#This field is automatically provided by Asset and Identity correlation features of applications like Splunk Enterprise Security.
#Authentication	src_category	string	The category of the authentication source, such as email_server or SOX-compliant.

#This field is automatically provided by Asset and Identity correlation features of applications like Splunk Enterprise Security.
#Authentication	src_nt_domain	string	The name of the Active Directory used by the authentication source, if applicable.
#Authentication	src_priority	string	The priority of the authentication source.
#Authentication	src_user	string	In privilege escalation events, src_user represents the user who initiated the privilege escalation. This field is unnecessary when an escalation has not been performed.
#Authentication	src_user_bunit	string	The business unit of the user who initiated the privilege escalation. This field is unnecessary when an escalation has not been performed.
#Authentication	src_user_category	string	The category of the user who initiated the privilege escalation. This field is unnecessary when an escalation has not been performed.
#Authentication	src_user_priority	string	The priority of the user who initiated the privilege escalation. This field is unnecessary when an escalation has not been performed.
#Authentication	tag	string	A tag associated with the authentication event.
#Authentication	user	string	The name of the user involved in the event, or who initiated the event. For authentication privilege escalation events this should represent the user targeted by the escalation.
#Authentication	user_bunit	string	The business unit of the user involved in the event, or who initiated the event. For authentication privilege escalation events this should represent the user targeted by the escalation.
#Authentication	user_category	string	The category of the user involved in the event, or who initiated the event. For authentication privilege escalation events this should represent the user targeted by the escalation.
#Authentication	user_priority	string	The priority of the user involved in the event, or who initiated the event. For authentication privilege escalation events this should represent the user targeted by the escalation.
#
